Revit 2022 API
RevisionSettings.SetNumericRevisionSettings Method
 Replaces the current numeric revision numbering settings with the specified NumericRevisionSettings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Since: 2016
Syntax
C#
[ObsoleteAttribute("This method is deprecated in Revit 2022 and may be removed in a later version of Revit. Please use `RevisionNumberingSequence.SetNumericRevisionSettings` instead.")]
public void SetNumericRevisionSettings(
	NumericRevisionSettings newSettings
)
Visual Basic
<ObsoleteAttribute("This method is deprecated in Revit 2022 and may be removed in a later version of Revit. Please use `RevisionNumberingSequence.SetNumericRevisionSettings` instead.")> _
Public Sub SetNumericRevisionSettings ( _
	newSettings As NumericRevisionSettings _
)
Visual C++
[ObsoleteAttribute(L"This method is deprecated in Revit 2022 and may be removed in a later version of Revit. Please use `RevisionNumberingSequence.SetNumericRevisionSettings` instead.")]
public:
void SetNumericRevisionSettings(
	NumericRevisionSettings^ newSettings
)
Parameters
newSettings
Type: Autodesk.Revit.DB.NumericRevisionSettings
 The specified NumericRevisionSettings to be applied to numeric revision numbering.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  newSettings is not a valid NumericRevisionSettings.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
RevisionSettings Class
Autodesk.Revit.DB Namespace